/* Translation.strings\n    SAPTracker\n  \n    Created by Raimund Wege on 27.07.16.\n    Copyright © 2016 com.sap.sailing. All rights reserved.\n  \n\n   MARK: - Common */
"Common.Cancel" = "Cancelar";

"Common.OK" = "OK";

"Common.Info" = "Info";

"Common.Warning" = "Advertencia";

"Common.Error" = "Error";

"Common.Yes" = "Sí";

"Common.No" = "No";

"Common.Settings" = "Opciones";

"Common.Logout" = "Cierre de sesión";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Hola %@";

"RegattaCheckInController.WelcomeAlert.Message" = "Está iniciando la sesión como %@.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "No soy yo";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Modo";

"GPSFixController.Mode.Error" = "Error API";

"GPSFixController.Mode.BatterySaving" = "Ahorro de batería";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "En línea";

"GPSFixController.Mode.Offline" = "Sin conexión";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "El GPS está desactivado para esta aplicación, pero para rastrear se necesitan las posiciones de GPS. ¿Desea activar el GPS en las opciones de ubicación?";

"LocationManager.LocationServicesDisabledError" = "El GPS está desactivado, pero para rastrear se necesitan las posiciones de GPS. ¿Desea activar el GPS en las opciones de ubicación?";

"LocationManager.Status" = "Estado";

"LocationManager.Status.Tracking" = "Rastreo";

"LocationManager.Status.NotTracking" = "Sin señal de GPS";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "No se ha encontrado ningún competidor no ID de marca en el código QR.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "No ha sido posible completar la operación en el servidor. Inténtelo de nuevo.";

"CheckInRequestManagerError.GetBoatFailed" = "No se ha podido obtener embarcación.";

"CheckInRequestManagerError.GetCompetitorFailed" = "No se ha podido obtener competidor.";

"CheckInRequestManagerError.GetEventFailed" = "No se ha podido obtener evento.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "No se ha podido obtener tabla de clasificación.";

"CheckInRequestManagerError.GetMarkFailed" = "No se ha podido obtener marca";

"CheckInRequestManagerError.GetTeamFailed" = "No se ha podido obtener equipo.";

"CheckInRequestManagerError.PostCheckInFailed" = "Error en check in";

"CheckInRequestManagerError.PostCheckOutFailed" = "Error en check out";

"CheckInRequestManagerError.PostGPSFixFailed" = "No se han podido enviar posiciones de GPS.";

"CheckInRequestManagerError.PostTeamImageFailed" = "No se ha podido cargar la imagen del equipo.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "La URL de la imagen del equipo no es válida.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Regatas";

"StartView.TrainingButton.Title" = "Formación individual";

/* MARK: - AboutView */
"AboutView.Title" = "A cerca de esta aplicación";

"AboutView.PartnershipTextView.Text" = "La aplicación SAP Sail InSight es compatible con el rastreo en directo de embarcaciones de competición al aprovechar la tecnología del teléfono móvil y permitiendo a los amigos y a las personas interesadas seguir las carreras ya sea en el lugar o en línea a través de tablas de clasificación en vivo y visualización 2D. Los regatistas pueden reproducir sus carreras ofreciéndoles la oportunidad de revisar el rendimiento y optimizar las estrategias disponibles: https://www.sapsailing.com\n\nSAP resulta compatible con US Sailing gracias a la implementación de una gama de soluciones tecnológicas innovadoras que ofrecen analíticas que ayudan a los regatistas a mejorar el rendimiento, a la vez que facilitan que las aplicaciones que ayudan en las operaciones de navegación se ejecuten de forma más eficiente.\n\nUS Sailing, en calidad de órgano regulador nacional para la navegación a vela, proporciona el liderazgo, la integridad y el crecimiento para el deporte, incluidos programas de capacitación y educación para instructores y comisarios de la carrera, a la ves que gestiona y supervisa la navegación de competición en todo el país.";

"AboutView.TermsButton.Title" = "EULA";

"AboutView.VersionTitleLabel.Text" = "Versión";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Rumbo sobre fondo";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Regatas";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Sus regatas:";

"RegattaCheckInListView.FooterTextView.Text" = "Más información en\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "El código QR se puede encontrar en su confirmación de participación.";

"RegattaCheckInListView.TermsAlert.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.Message" = "Al utilizar esta aplicación, confirma que acepta el acuerdo de licencia de usuario final (EULA) de SAP SE. Por favor, lea este EULA aquí.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Confirmar";

"RegattaCheckInListView.NoCameraAlert.Message" = "El dispositivo carece de cámara.";

"RegattaCheckInListView.NoCodeAlert.Title" = "¿No dispone de una Código QR?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Póngase en contacto con la gestión de la carrera si no ha recibido un código QR.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Formaciones";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Sus formaciones:";

"TrainingCheckInListView.FooterTextView.Text" = "Para gestionar las sesiones de formación, cree, al menos, una formación usando el botón más.";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analizar";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Eliminar formación";

"TrainingView.FinishButton.Title" = "Finalizar";

"TrainingView.ReactivateAlert.Title" = "Reactivar formación";

"TrainingView.ReactivateAlert.Message" = "Esta sesión de formación ha finalizado. ¿Desea realmente proceder y reactivar esta sesión?";

"TrainingView.ReactivatedAlert.Title" = "Ahora, la sesión de formación está activa";

"TrainingView.FinishAlert.Title" = "Finalizar formación";

"TrainingView.FinishAlert.Message" = "¿Desea finalizar esta sesión de formación?";

"TrainingView.FinishedAlert.Title" = "la sesión de formación ha finalizado con éxito.";

"TrainingView.CheckOutAlert.Message" = "¿Desea REALMENTE eliminar esta sesión de formación de su dispositivo?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Crear formación";

"CreateTrainingView.BoatClassNameLabel.Text" = "Clase de embarcación";

"CreateTrainingView.CreateTrainingButton.Title" = "Crear formación";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Tabla de clasificación";

/* MARK: - LicenseView */
"LicenseView.Title" = "Información de licencia";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Días";

"RegattaView.CountdownHoursTitleLabel.Text" = "Horas";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minutos";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "La regata comienza en:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "La regata progresa.";

"RegattaView.AnnouncementLabel.Text" = "Preste atención a los avisos.";

"RegattaView.EventButton.Title" = "Evento";

"RegattaView.StartTrackingButton.Title" = "Comenzar rastreo";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Check out";

"RegattaView.CheckOutAlert.Message" = "¿Desea realmente cerrar la sesión? Tendrá que volver a iniciar la sesión con el código QR facilitado para acceder a su regata.";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Foto";

"CompetitorView.SelectImageAlert.Message" = "¿Desea utilizar una imagen existente o tomar una nueva?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Hacer foto";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Existente";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Error durante la carga.\nToque para volver a intentarlo.";

"CompetitorView.TeamImageAddButton.Title" = "Añadir foto del equipo";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Error al cargar la imagen";

/* MARK: - ScanView */
"ScanView.Title" = "Escanear código QR";

"ScanView.IncorrectCodeAlert.Message" = "Código QR no válido";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Velocidad sobre fondo";

/* MARK: - SettingsView */
"SettingsView.Title" = "Opciones";

"SettingsView.TableView.BatterySavingSection.Title" = "Ahorro de batería";

"SettingsView.TableView.DeviceSection.Title" = "Información del dispositivo";

"SettingsView.TableView.TrainingSection.Title" = "Área de formación";

"SettingsView.BatterySavingTitleLabel.Text" = "Ahorrar energía";

"SettingsView.BatterySavingDescriptionLabel.Text" = "Las actualizaciones del GPS se están enviando al servidor cada %0.0f segundos.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Identificador del dispositivo";

"SettingsView.TrainingServerTitleLabel.Text" = "Punto de acceso del servidor";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Hora de rastreo";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Correcciones sin enviar";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Exactitud del GPS";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "Sin GPS";

"TrackingView.StopTrackingButton.Title" = "Detener rastreo";

"TrackingView.StopTrackingAlert.Title" = "Confirme";

"TrackingView.StopTrackingAlert.Message" = "¿Seguro que desea eliminar el rastreo?";

